Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotCutJoinedGeometry Property
 Element could not be cut by joined element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutJoinedGeometry { get; }
Public Shared ReadOnly Property CannotCutJoinedGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutJoinedGeometry {
	FailureDefinitionId^ get ();
}
static member CannotCutJoinedGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace